html/7.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-27 Tue 09:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>子模式</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shuai Zhao" />
<link rel="stylesheet" type="text/css" href="../resource/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">子模式</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd289e56">1. 在本章：</a></li>
<li><a href="#org07c72a1">2. 段落填充</a></li>
<li><a href="#orga8e893c">3. 模式</a></li>
<li><a href="#org2e2ccd2">4. 定义子模式</a></li>
<li><a href="#orgee15b6d">5. Mode Meat</a>
<ul>
<li><a href="#org35021d0">5.1. Naive的首次尝试</a></li>
<li><a href="#orga8cd29f">5.2. 限制refill</a></li>
<li><a href="#org5fbfd3f">5.3. 小调整</a></li>
<li><a href="#orgd7d5e41">5.4. 排除不希望的重排</a></li>
<li><a href="#org2994f9e">5.5. 尾空格</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd289e56" class="outline-2">
<h2 id="orgd289e56"><span class="section-number-2">1</span> 在本章：</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>段落填充</b><br />
<b>模式</b><br />
<b>定义子模式</b><br />
<b>Mode Meat</b><br />
</p>

<p>
有时我们希望扩展（extension）只影响某些特定类型的buffer而不是所有的buffer。本章我们将通过思考这个问题来提高我们在Emacs编程中的灵活性。例如，你在Lisp模式下按下C-M-a会跳转到最近的函数定义，但是你不希望在编辑文档的时候也这样。Emacs的“模式（mode）”机制使得C-M-a只会在Lisp模式下才产生效果。<br />
</p>

<p>
关于Emacs中模式的相关主题是很复杂的。我们将以学习“子模式（minor modes）”来作为一个轻松良好的开始。在buffer中，子模式是可以与主模式共同存在的，它的作用是添加较少的一些特定功能的新行为。每个Emacs用户都对像Lisp、C以及Text这种主模式很熟悉，但是他们可能对于出现在模式栏（mode line）中的例如“Fill”这种表示自动填充的标识并不熟悉。<br />
</p>

<p>
我们将基于Emacs自身的段落填充功能创建一个子模式。我们的子模式，Refill，将会在你编辑段落的时候进行动态填充。<br />
</p>
</div>
</div>

<div id="outline-container-org07c72a1" class="outline-2">
<h2 id="org07c72a1"><span class="section-number-2">2</span> 段落填充</h2>
<div class="outline-text-2" id="text-2">
<p>
填充一个段落是将段落中所有行的长度变得适当的过程。每行的长度都应该大概相等并且不会越过右边距（right margin）。过长的行应该在词之间的空格处进行拆分。短行应该用后面行的文字进行填充。填充有时还包括左右对齐（justification），也就是通过在每一行添加空格来使得左右边距相等。<br />
</p>

<p>
大多数现代文字处理软件都会保证段落的填充。每次文字修改时，段落中的文字会“流动”以完成正确的布局。一些Emacs的批评者指出Emacs在填充段落时的表现不如其他软件。Emacs虽然提供了auto-fill-mode，但是这只在当前行生效，而且只有当超过“右边距”并且插入空格时才会触发。在删除字符时并不会触发；除了当前行之外的行都不会被填充；并且在行的左边插入文字而使右边的文字超过右边距时也不会触发。<br />
</p>

<p>
作为Emacs狂热者，对于像neplus ultra这样的编辑器的支持者们你可以给出下面的三个答复之一：<br />
</p>
<ol class="org-ol">
<li>像动态段落填充这种华丽的特性只能被用来掩饰这个软件其他不如Emacs的地方（你可以根据所需列出来）。<br /></li>
<li>你认为内容要比格式更重要，所以不需要自动的段落填充，当你觉得自己需要时，只需要简单的按下M-q来触发fill-paragraph就好了。<br /></li>
<li>做一点简单的Lisp hacking，Emacs就可以像别的程序那样完成动态段落填充了（然后你也可以问一下他们的编辑器是否也能模仿Emacs的这种行为）。<br /></li>
</ol>

<p>
本章是关于选择3的。<br />
</p>

<p>
为了确保当前段落一直正确地填充，我们需要在每次执行插入和删除后进行一次检查。这在计算上可能开销很大，所以我们希望能够对其进行开关；由于并不是所有buffer都需要这个功能，因此当它打开时，我们只希望它在当前buffer生效。<br />
</p>
</div>
</div>

<div id="outline-container-orga8e893c" class="outline-2">
<h2 id="orga8e893c"><span class="section-number-2">3</span> 模式</h2>
<div class="outline-text-2" id="text-3">
<p>
Emacs使用模式这个概念来封装一系列编辑行为。换句话说，使用不同的模式，Emacs在buffers里的表现是不同的。举一个小例子，在Text模式中TAB键插入一个ASCII的制表符，而在Emacs Lisp模式中这将会通过插入或者删除空格来将代码缩进到正确的列上。再举一个例子，当你在Emacs Lisp模式的buffer里执行命令indent-for-comment时，你将会得到一个以Lisp注释符“;”开头的空注释。而当你在C模式的buffer里，你得到的是C语言的注释/* */。<br />
</p>

<p>
每个buffer总是属于一个主模式（major mode）。主模式指定了buffer用于某种特定类型的编辑行为，例如Text、Lisp或者C。名为Fundamental的主模式并不为特定类型的编辑存在，你可以认为它是一种空模式。通常buffer的主模式的选择是根据你访问的文件的名称，或者buffer中的一些设置进行的。你可以通过执行模式的命令来改变主模式，例如text-mode、emacs-lisp-mode、或者c-mode。[<a href="#orga1a0468">27</a>]当你这么做之后，buffer就使用新的主模式替换之前的模式了。<br />
</p>

<p>
与此不同的是，子模式向buffer里添加一系列功能而并不完全改变buffer原本的编辑方式。子模式可以与主模式以及其他子模式单独打开关闭。buffer除了主模式之外还可能在0、1、2、3或者多个子模式之下。举几个子模式的例子：auto-save-mode，使buffer在编辑的时候每隔一段时间就存储到特定名称的文件里（当系统崩溃时这些缓存文件就可以避免编辑的丢失）；font-lock-mode，根据当前buffer的语法以不同颜色显示文本（如果显示器支持）；line-number-mode，在buffer的模式栏里显示当前编辑的行号（在底部）。<br />
</p>

<p>
通常，如果一个包需要在不同的buffer中分别打开与关闭，那么它就应该被实现为子模式而不是主模式。这与我们上一部分中所描述的段落填充的需求是一致的，因此可以知道我们的段落填充功能应该是一个子模式。我们将在<a href="9.html">第九章</a>中再关注主模式的实现。<br />
</p>
</div>
</div>

<div id="outline-container-org2e2ccd2" class="outline-2">
<h2 id="org2e2ccd2"><span class="section-number-2">4</span> 定义子模式</h2>
<div class="outline-text-2" id="text-4">
<p>
在定义子模式时需要有下面这些步骤。<br />
</p>
<ol class="org-ol">
<li>选择一个名字。我们的模式名称为refill。<br /></li>
<li><p>
定义一个名为name-mode的变量。使其成为buffer局部的。buffer的子模式在这个变量的值为非空的情况下表示打开，否则关闭。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">refill-mode</span> nil
  <span style="color: #75715E;">"Mode variable for refill minor mode."</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>make-variable-buffer-local 'refill-mode<span style="color: #AE81FF;">)</span>
</pre>
</div></li>
<li><p>
定义一个名为name-mode的命令。[<a href="#orgfa68a53">28</a>]这个命令应该具有一个可选参数。如果不提供参数，它将打开或关闭模式。如果提供参数，且参数的prefix-numeric-value大于0则打开模式，否则关闭模式。也就是说，C-u M-x name-mode RET总是执行打开，而C-u - M-x name-mode RET总是关闭模式（查看<a href="2.html">第2章</a>中的<a href="2.html#MissingReference">补充：原始的前置参数</a>获得更多信息）。下面是开关Refill模式的命令定义：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">refill-mode</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">&amp;optional</span> arg<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Refill minor mode."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">interactive</span> <span style="color: #E6DB74;">"P"</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> refill-mode
        <span style="color: #A6E22E;">(</span><span style="color: #F92672;">if</span> <span style="color: #E6DB74;">(</span>null arg<span style="color: #E6DB74;">)</span>
            <span style="color: #E6DB74;">(</span>not refill-mode<span style="color: #E6DB74;">)</span>
          <span style="color: #E6DB74;">(</span>&gt; <span style="color: #FD971F;">(</span>prefix-numeric-value arg<span style="color: #FD971F;">)</span> 0<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> refill-mode
      code for turning on refill-mode
      code for turning off refill-mode<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
setq语句看起来有些奇怪，但这在子模式定义中是一种常见的格式。如果arg为nil（没有前置参数），它会将refill-mode设置为(not refill-mode)&#x2013;也就是refill-mode之前值的相反值，t或者nil。否则，它将refill-mode设置为<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>&gt; <span style="color: #66D9EF;">(</span>prefix-numeric-value arg<span style="color: #66D9EF;">)</span> 0<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
的值，当arg的值为大于0的数字时为t，否则为nil。<br />
</p></li>
<li><p>
向minor-mode-alist中添加一项，它是一个这种形式的assoc list（查看<a href="6.html">第六章</a>中<a href="6.html#MissingReference">其他有用的列表函数</a>章节）：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span>model string1<span style="color: #66D9EF;">)</span>
 <span style="color: #66D9EF;">(</span>mode2 string2<span style="color: #66D9EF;">)</span>
 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
新的项会将name-mode关联到一个将会在buffer的模式栏中使用的短字符串。模式栏（mode line）是每个Emacs窗口底部的信息栏；它会显示每个buffer的主模式名称以及其他处于激活状态的子模式名称，以及其他的一些信息。描述子模式的短字符串应该以空格开头，因为它会追加到信息栏的模式相关部分。下面的例子展示了对于Refill模式该如何做：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>not <span style="color: #A6E22E;">(</span>assq 'refill-mode minor-mode-alist<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
    <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> minor-mode-alist
          <span style="color: #A6E22E;">(</span>cons '<span style="color: #E6DB74;">(</span>refill-mode <span style="color: #E6DB74;">" Refill"</span><span style="color: #E6DB74;">)</span>
                minor-mode-alist<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
（最外层的if保证了(refill-mode " Refill")不会二次添加到minor-mode-alist里，例如当两次加载refill.el。）这让使用了refill-mode的buffer的模式栏看起来是这样的：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">--**-Emacs: foo.txt <span style="color: #AE81FF;">(</span>Text Refill<span style="color: #AE81FF;">)</span> --L1--Top---
</pre>
</div>

<p>
在定义子模式时还有一些其他步骤在这个例子中没涉及。例如，子模式可能有一个keymap，一个与之关联的语法表(syntax table)，或者一个abbrev表，但是因为refill-mode用不到，我们这里暂且忽略。<br />
</p></li>
</ol>
</div>
</div>
