7.org
* Mode Meat
现在我们有了基本结构，让我们开始定义Refill mode的内容。

我们已经弄清了refill-mode的基本特性：每次插入和删除都必须保证当前段落的正确缩进。当buffer改变时触发代码执行的正确做法，你可以回想一下[[file:4.org][第四章]]，就是当refill-mode激活时向钩子变量after-change-functions添加一个函数(关闭时移除)。我们将会添加一个refill函数(还未定义)来确保当前段落会被正确缩进。
#+BEGIN_SRC emacs-lisp
  (defun refill-mode (&optional arg)
    "Refill minor mode."
    (interactive "P")
    (setq refill-mode
          (if (null arg)
              (not refill-mode)
            (> (prefix-numeric-value arg) 0)))
    (make-local-hook 'after-change-functions)
    (if refill-mode
        (add-hook 'after-change-functions 'refill nil t)
      (remove-hook 'after-change-functions 'refill t)))
#+END_SRC

add-hook和remove-hook后面的参数保证了我们修改的只是buffer局部的after-change-functions。不管在调用这个函数时refill-mode有没有打开，我们都调用(make-local-hook 'after-change-functions)来使其变为buffer局部的。这是因为在这两种情况--打开refill-mode或关闭--我们都需要对每个buffer单独操作after-change-functions。总是先调用make-local-hook是最简单的方式，而且如果一个钩子变量已经是buffer局部的，再次调用也没有什么副用。

现在剩下的事情就是定义refill函数了。

** Naive的首次尝试
就像第四章中提到的，钩子变量after-change-functions有些特殊，因为其中的函数需要三个参数(普通的钩子函数通常不需要参数)。三个参数指明了在after-change-functions执行之前，buffer的改变发生的地方。
+ 改变开始处，称为start
+ 改变结束处，称为end
+ 影响的文本长度，称为len

start和end指向buffer改变发生之后的位置。len指向与改变发生之前相比影响的文本长度。在插入发生之后，len为0(因为并不影响之前buffer中的文本)，而新插入的文本在start和end之间。在删除发生之后，len为删除的文本的长度，文本已经被丢掉，而start和end为同一个数字，因为删除文本使它们指向了同一处，也就是删除内容的两端合二为一了。

现在我们知道了refill的参数应该是什么，我们可以做出一个朴素的尝试来对其进行定义：
#+BEGIN_SRC emacs-lisp
  (defun refill (start end len)
    "After a text change, refill the current paragraph."
    (fill-paragraph nil))
#+END_SRC

这种实现是非常不严谨的，因为每次按键都调用fill-paragraph代价太大了！它还有一个问题，就是每次向行尾添加一个空格时，fill-paragraph都会把它立即删除--它会在缩进的时候自动把尾部空格删除掉--因此，当你打字的时候，你将会花费最多的时间在行尾，唯一向两个单词间插入空格的方式就是先把两个单词打出来，likethis，然后向其中插入一个空格。但是这个尝试证明了我们的理论，并且给了我们一个可以对其进行改进的起点。[[[7-29][29]]]

