html/7.html

<div id="outline-container-orgee15b6d" class="outline-2">
<h2 id="orgee15b6d"><span class="section-number-2">5</span> Mode Meat</h2>
<div class="outline-text-2" id="text-5">
<p>
现在我们有了基本结构，让我们开始定义Refill mode的内容。<br />
</p>

<p>
我们已经弄清了refill-mode的基本特性：每次插入和删除都必须保证当前段落的正确缩进。当buffer改变时触发代码执行的正确做法，你可以回想一下<a href="4.html">第四章</a>，就是当refill-mode激活时向钩子变量after-change-functions添加一个函数(关闭时移除)。我们将会添加一个refill函数(还未定义)来确保当前段落会被正确缩进。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">refill-mode</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">&amp;optional</span> arg<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Refill minor mode."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">interactive</span> <span style="color: #E6DB74;">"P"</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> refill-mode
        <span style="color: #A6E22E;">(</span><span style="color: #F92672;">if</span> <span style="color: #E6DB74;">(</span>null arg<span style="color: #E6DB74;">)</span>
            <span style="color: #E6DB74;">(</span>not refill-mode<span style="color: #E6DB74;">)</span>
          <span style="color: #E6DB74;">(</span>&gt; <span style="color: #FD971F;">(</span>prefix-numeric-value arg<span style="color: #FD971F;">)</span> 0<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>make-local-hook 'after-change-functions<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> refill-mode
      <span style="color: #A6E22E;">(</span>add-hook 'after-change-functions 'refill nil t<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>remove-hook 'after-change-functions 'refill t<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
add-hook和remove-hook后面的参数保证了我们修改的只是buffer局部的after-change-functions。不管在调用这个函数时refill-mode有没有打开，我们都调用(make-local-hook 'after-change-functions)来使其变为buffer局部的。这是因为在这两种情况&#x2013;打开refill-mode或关闭&#x2013;我们都需要对每个buffer单独操作after-change-functions。总是先调用make-local-hook是最简单的方式，而且如果一个钩子变量已经是buffer局部的，再次调用也没有什么副用。<br />
</p>

<p>
现在剩下的事情就是定义refill函数了。<br />
</p>
</div>

<div id="outline-container-org35021d0" class="outline-3">
<h3 id="org35021d0"><span class="section-number-3">5.1</span> Naive的首次尝试</h3>
<div class="outline-text-3" id="text-5-1">
<p>
就像第四章中提到的，钩子变量after-change-functions有些特殊，因为其中的函数需要三个参数(普通的钩子函数通常不需要参数)。三个参数指明了在after-change-functions执行之前，buffer的改变发生的地方。<br />
</p>
<ul class="org-ul">
<li>改变开始处，称为start<br /></li>
<li>改变结束处，称为end<br /></li>
<li>影响的文本长度，称为len<br /></li>
</ul>

<p>
start和end指向buffer改变发生之后的位置。len指向与改变发生之前相比影响的文本长度。在插入发生之后，len为0(因为并不影响之前buffer中的文本)，而新插入的文本在start和end之间。在删除发生之后，len为删除的文本的长度，文本已经被丢掉，而start和end为同一个数字，因为删除文本使它们指向了同一处，也就是删除内容的两端合二为一了。<br />
</p>

<p>
现在我们知道了refill的参数应该是什么，我们可以做出一个朴素的尝试来对其进行定义：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">refill</span> <span style="color: #66D9EF;">(</span>start end len<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"After a text change, refill the current paragraph."</span>
  <span style="color: #66D9EF;">(</span>fill-paragraph nil<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这种实现是非常不严谨的，因为每次按键都调用fill-paragraph代价太大了！它还有一个问题，就是每次向行尾添加一个空格时，fill-paragraph都会把它立即删除&#x2013;它会在缩进的时候自动把尾部空格删除掉&#x2013;因此，当你打字的时候，你将会花费最多的时间在行尾，唯一向两个单词间插入空格的方式就是先把两个单词打出来，likethis，然后向其中插入一个空格。但是这个尝试证明了我们的理论，并且给了我们一个可以对其进行改进的起点。[<a href="#org54cbaa4">29</a>]<br />
</p>
</div>
</div>
