html/7.html

<div id="outline-container-orga8cd29f" class="outline-3">
<h3 id="orga8cd29f"><span class="section-number-3">5.2</span> 限制refill</h3>
<div class="outline-text-3" id="text-5-2">
<p>
要优化refill，让我们先对问题进行一下分析。首先，是否每次整个段落都需要重排？<br />
</p>

<p>
不。当插入和删除文本时，只有被影响的行和下面的行需要重排。前面的行并不需要。如果插入文本，行可能会变得太长，有些文本会挤入下一行(这可能会导致下一行也变得太长，因此这个过程是会重复的)。如果文本被删除，文本可能会变得太短，后续的行需要拿出一些文本来填补(这可能会导致下一行变得太短，因此这个过程也是会重复的)。所以变化并不会影响前面的行。<br />
</p>

<p>
实际上，有一种情况的变化会影响前面一行。考虑下面这一段：<br />
</p>
<div class="org-src-container">
<pre class="src src-text">Glitzy features like on-the-fly filling of paragraphs are
needed only to hide the programs's many inadequacies
compared to Emacs
</pre>
</div>

<p>
假设我们删除第三行开头处的"compared"：<br />
</p>
<div class="org-src-container">
<pre class="src src-text">Glitzy features like on-the-fly filling of paragraphs are
needed only to hide the programs's many inadequacies
to Emacs
</pre>
</div>

<p>
单词"to"现在可以移动到上一行的末尾处，就像这样：<br />
</p>
<div class="org-src-container">
<pre class="src src-text">Glitzy features like on-the-fly filling of paragraphs are
needed only to hide the programs's many inadequacies to 
Emacs
</pre>
</div>

<p>
前面的例子应该可以告诉你前面的一行也需要重排&#x2013;并且只有当前的行的第一个词被缩短或者删除的时候才会出现。<br />
</p>

<p>
所以我们可以将段落重排操作限制为当前行，可能会影响前一行，以及后续的行。我们不使用fill-paragraph，因为它会自己判断段落边界，相反的我们自己选择"段落边界"，然后使用fill-region。<br />
</p>

<p>
我们为fill-region选择的边界应该包含段落中整个受影响的部分。对于插入，左边界就是简单的start，也就是插入的点，右边界是当前段落的结尾。对于删除，左边界是前一行的开始(也就是，包含start的前一行)，右边界是行末尾。所以下面就是我们新的refill函数的概要：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">refill</span> <span style="color: #66D9EF;">(</span>start end len<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"After a text change, refill the current paragraph."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>left <span style="color: #FD971F;">(</span><span style="color: #F92672;">if</span> this is an insertion
                  start
                  beginning of previous line<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
        <span style="color: #E6DB74;">(</span>right end ofparagraph<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>fill-region left right ...<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
对于插入，完善这个函数是很简单的。之前说过，调用refill时，len为0则表示插入，非0则表示删除。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">refill</span> <span style="color: #66D9EF;">(</span>start end len<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"After a text change, refill the current paragraph."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>left <span style="color: #FD971F;">(</span><span style="color: #F92672;">if</span> <span style="color: #F92672;">(</span>zerop len<span style="color: #F92672;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">len&#26159;&#21542;&#20026;0&#65311;</span>
                  start
                beginning of previous line<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
        <span style="color: #E6DB74;">(</span>right end ofparagraph<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>fill-region left right ...<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
要计算前一行的开始，我们先要把光标移动到start，然后将光标移动到前一行的末尾(很奇怪，这可以通过(beginning-of-line 0)来得到)，然后使用(point)来得到这个值，所有这些都放在save-excursion里：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">refill</span> <span style="color: #66D9EF;">(</span>start end len<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"After a text change, refill the current paragraph."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>left <span style="color: #FD971F;">(</span><span style="color: #F92672;">if</span> <span style="color: #F92672;">(</span>zerop len<span style="color: #F92672;">)</span>
                  start
                <span style="color: #F92672;">(</span><span style="color: #F92672;">save-excursion</span>
                  <span style="color: #AE81FF;">(</span>goto-char start<span style="color: #AE81FF;">)</span>
                  <span style="color: #AE81FF;">(</span>beginning-of-line 0<span style="color: #AE81FF;">)</span>
                  <span style="color: #AE81FF;">(</span>point<span style="color: #AE81FF;">)</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
              <span style="color: #E6DB74;">(</span>right end ofparagraph<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
        <span style="color: #A6E22E;">(</span>fill-region left right ...<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
我们可以对段落的结束采用类似的计算方式，但是我们可以更方便的利用fill-region的特性：它将为我们找到段落结尾。fill-region的第五个参数(有两个必要参数和三个可选参数)，如果非空，将会告诉fill-region一直重排到下一段之前。所以实际上我们并不需要计算right。<br />
</p>

<p>
我们新版本的refill还没完成。我们必须首先解决fill-region会将光标放置到影响区域的末尾的问题。显然每次输入都把光标移动到段落末尾是不可接受的！将fill-region的调用包装在save-excursion里会解决这个问题。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">refill</span> <span style="color: #66D9EF;">(</span>start end len<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"After a text change, refill the current paragraph."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>left <span style="color: #FD971F;">(</span><span style="color: #F92672;">if</span> <span style="color: #F92672;">(</span>zerop len<span style="color: #F92672;">)</span>
                  start
                <span style="color: #F92672;">(</span><span style="color: #F92672;">save-excursion</span>
                  <span style="color: #AE81FF;">(</span>goto-char start<span style="color: #AE81FF;">)</span>
                  <span style="color: #AE81FF;">(</span>beginning-of-line O<span style="color: #AE81FF;">)</span>
                  <span style="color: #AE81FF;">(</span>point<span style="color: #AE81FF;">)</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
        <span style="color: #E6DB74;">(</span><span style="color: #F92672;">save-excursion</span>
          <span style="color: #FD971F;">(</span>fill-region left end nil nil t<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
(fill-region的第二个参数被忽略了，因为我们使用了它找寻段落结尾的特性。我们传递end只是因为这很方便而且对于读者来说并不是完全无意义的。)<br />
</p>
</div>
</div>
