7.org
** 小调整
好的，上面的只是基本的想法，还剩下许多事情要做。例如，当计算left时，如果前一行已经不在这个段落那么就没有必要再计算前一行了。所以我们应该得到行的开始以及前一行的开始，然后使用更大的那个值。
#+BEGIN_SRC emacs-lisp
  (defun refill (start end len)
    "After a text change, refill the current paragraph."
    (let ((left (if (zerop len)
                    start
                  (max (save-excursion
                         (goto-char start)
                         (beginning-of-line 0)
                         (point))
                       (save-excursion
                         (goto-char start)
                         (backward-paragraph 1)
                         (point))))))
      (save-excursion
        (fill-region left end nil nil t))))
#+END_SRC

(函数max会返回参数里更大的那个。)

现在我们有三个地方调用了save-excursion，而这是个代价有点大的函数。更好的做法是将其中两个合并在一起然后计算两个需要的值。
#+BEGIN_SRC emacs-lisp
  (defun refill (start end len)
    "After a text change, refill the current paragraph."
    (let ((left (if (zerop len)
                    start
                  (save-excursion
                    (max (progn
                           (goto-char start)
                           (beginning-of-line 0)
                           (point))
                         (progn
                           (goto-char start)
                           (backward-paragraph 1)
                           (point)))))))
      (save-excursion
        (fill-region left end nil nil t))))
#+END_SRC

下一步，回想我们关于重排前一行的观察:"前面的一行也需要重排--并且只有当前行的第一个词被缩短或者删除的时候才会出现。" 但是在我们的代码里，我们在删除的时候每次都会计算前一行。让我们看看在删除发生在非第一个词之外的地方时能否避免这个计算。

我们可以通过将下面的代码
#+BEGIN_SRC emacs-lisp
  (if (zerop len)
      start
    find previous line)
#+END_SRC

修改为
#+BEGIN_SRC emacs-lisp
  (if (or (zerop len)
          (not (before-2nd-word-p start)))
      start
    find previous line)
#+END_SRC

来实现。before-2nd-word-p是一个用来告诉它的参数，一个buffer位置，是否出现在第二个单词之前的函数。

现在我们必须写出before-2nd-word-p。它应该找出当前行的第二个单词的位置，并且跟它的参数进行比较。

如何才能找到行中的第二个单词呢？

我们可以到行的开始，然后调用forward-word来跳过第一个单词。这个方法的问题是我们得到的是第一个单词的末尾，而非第二个单词的开头，它们之间可能有很多空格。

我们可以到行的开始，然后调用forward-word两次(实际上，我们可以调用forward-word一次，传入参数2)，然后调用backward-word，这就会把我们置于第二个单词的开头。这不错，但是我们认识到forward-word和backward-word定义的"word"跟我们需要的定义并不相同。根据这些函数，标点符号(例如破折号)会分开单词，所以(例如)"forward-word"是两个单词。这对我们来说并不好，因为我们的函数只认为被空格分割才算两个单词。

我们可以到行的开始，然后跳过所有非空格的字符(第一个单词)，然后跳过所有空格字符(第一个单词之后的空格)，然后我们就在第二个单词的开头了。这听起来好一些；让我们试一下。
#+BEGIN_SRC emacs-lisp
  (defun before-2nd-word-p (pos)
    "Does POS lie before the second word on the line?"
    (save-excursion
      (goto-char pos)
      (beginning-of-line)
      (skip-chars-forward "^ ")
      (skip-chars-forward " ")
      (< pos (point))))
#+END_SRC

函数skip-chars-forward非常实用。它会向前移动光标，直到遇到一个你所指定的字符集里包含或者不包含的字符。字符集的工作方式跟正则表达式中的方括号语法一样(参考[[file:4.org][第四章]]中的[[file:4.org::*正则表达式][正则表达式]]中的规则3).所以
#+BEGIN_SRC emacs-lisp
  (skip-chars-forward "^ ")
#+END_SRC

表示"跳过不是空格的所有字符"，而
#+BEGIN_SRC emacs-lisp
  (skip-chars-forward " ")
#+END_SRC

表示"跳过所有空格"。

这个方式的一个问题就是当一行里没有空格时，
#+BEGIN_SRC emacs-lisp
  (skip-chars-forward "^ ")
#+END_SRC

将会直接跳到下一行！我们不希望这样。所以我们通过向第一个skip-chars-forward添加一个换行符来确保我们不会略过太多：
#+BEGIN_SRC emacs-lisp
  (skip-chars-forward "^ \n") ; 跳到第一个空格或者换行符
#+END_SRC

另一个问题是有时tab("\t")制表符也有可能用来像空格一样分割单词。所以我们必须这样来修改我们的两个skip-chars-forward调用：
#+BEGIN_SRC emacs-lisp
  (skip-chars-forward "^ \t\n")
  (skip-chars-forward " \t")
#+END_SRC

还有其他的类似空格和制表符一样的被认为是空格的字符吗？也许有。换页符(ASCII 12)通常被认为是空格。而如果buffer使用了非ASCII的编码，有可能还有一些其他的字符会被认为是分隔单词的空格。例如，对于Latin-1这样8位字符编码，字符数字32和160都是空格--虽然160表示"非折断空格"，即行不应该在此处折断。

与其我们关心这些细节，为什么不让Emacs自己判断呢？这就是语法表（syntax tables）发挥作用的时候了。语法表是一个与模式关联的将字符对应到"语法类别(syntax classes)"的映射表。类别包括"word constituent"(通常包括单词、省略号，有时包括数字)，"balanced brackets"(通常为(), [], {}, 有时包括<>)，"comment delimiters"(对于Lisp mode来说就是“;”， 对于C mode则为/*和*/)，"punctuation"，以及当然的，"whitespace"。

语法表被一些像forward-word和backward-word这样的函数用来找出一个词的类别是什么。因为不同的buffer有不同的语法表，同一个词的的定义可能会各有不同。我们将会使用语法表来找出在当前buffer中哪些字符被认为是空格。

我们所需要做的就是将我们两次的skip-chars-forward调用替换为skip-syntax-forward，就像这样：
#+BEGIN_SRC emacs-lisp
  (skip-syntax-forward "^ ")
  (skip-syntax-forward " ")
#+END_SRC

对于每个语法类别，都有一个对应的code letter。[[[7-30][30]]]空格是"whitespace"的code letter，所以上面的两行表示"跳过所有非空格"和"跳过所有空格"。

不幸的是，前面的skip-syntax-forward调用也有跳到下一行的问题。更坏的是，这次我们不能简单的将\n添加到skip-syntax-forward的参数里，因为\n并不是换行符语法类别的code letter。实际上，在不同buffer里的换行字符的code letter是不同的。

我们能做的是请求Emacs告诉我们换行字符的code letter是什么，然后使用这个结果来构建skip-syntax-forward的参数：
#+BEGIN_SRC emacs-lisp
  (skip-syntax-forward (concat "^ "
                               (char-to-string
                                (char-syntax ?\n))))
#+END_SRC

函数char-syntax会返回字符的code letter。然后我们使用char-to-string将其转换为一个字符串并且添加到"^ "。

这是before-2nd-word-p的最终形态：
#+BEGIN_SRC emacs-lisp
  (defun before-2nd-word-p (pos)
    "Does POS lie before the second word on the line?"
    (save-excursion
      (goto-char pos)
      (beginning-of-line)
      (skip-syntax-forward (concat "^ "
                                   (char-to-string
                                    (char-syntax ?\n))))
      (skip-syntax-forward " ")
      (< pos (point))))
#+END_SRC

记住计算before-2nd-word-p的代价可能会超过它本身想提供的好处(即，在refill中避免调用end-of-line和backward-paragraph)。如果你感兴趣的话，你可以试着使用性能分析器(参见[[file:C.org][附录C]])来查看哪个版本的refill更快，是使用before-2nd-word-p的还是不使用的。

