7.org
** 排除不希望的重排
在每次插入发生的时候我们并不需要重排段落。一个微小的并不会将任何文本推到右边界的插入并不会影响除它之外的任何其他行，所以如果当前改变是一次插入，并且start和end在同一行，并且行的末尾并没有超过右边界，那么我们没有必要调用fill-region。

这意味着我们需要把fill-region的调用包裹在一个if里，如下所示：
#+BEGIN_SRC emacs-lisp
  (if (and (zerop len) ; 如果是插入...
           (same-line-p start end) ; ...并且没有跨行
           (short-line-p end)) ; ...并且行仍然够短
      nil ; 那么什么都不做
    (save-excursion
      (fill-region ...))) ; 否则，refill
#+END_SRC

我们现在必须定义same-line-p和short-line-p。

现在看来编写same-line-p应该很简单。我们只需要简单的检测end是否在start和行尾之间就可以了。
#+BEGIN_SRC emacs-lisp
  (defun same-line-p (start end)
    "Are START and END on the same line?"
    (save-excursion
      (goto-char start)
      (end-of-line)
      (<= end (point))))
#+END_SRC

编写short-line-p也差不多同样明了。用于控制右边界的变量称为fill-column，而current-column返回一个点的横座标。
#+BEGIN_SRC emacs-lisp
  (defun short-line-p (pos)
    "Does line containing POS stay within 'fill-column'?"
    (save-excursion
      (goto-char pos)
      (end-of-line)
      (<= (current-column) fill-column)))
#+END_SRC

下面是refill的新的定义：
#+BEGIN_SRC emacs-lisp
  (defun refill (start end len)
    "After a text change, refill the current paragraph."
    (let ((left (if (or (zerop len)
                        (not (before-2nd-word-p start)))
                    start
                  (save-excursion
                    (max (progn
                           (goto-char start)
                           (beginning-of-line 0)
                           (point))
                         (progn
                           (goto-char start)
                           (backward-paragraph 1)
                           (point)))))))
      (if (and (zerop len)
               (same-line-p start end)
               (short-line-p end))
          nil
        (save-excursion
          (fill-region left end nil nil t)))))
#+END_SRC

