html/7.html

<div id="outline-container-orgd7d5e41" class="outline-3">
<h3 id="orgd7d5e41"><span class="section-number-3">5.4</span> 排除不希望的重排</h3>
<div class="outline-text-3" id="text-5-4">
<p>
在每次插入发生的时候我们并不需要重排段落。一个微小的并不会将任何文本推到右边界的插入并不会影响除它之外的任何其他行，所以如果当前改变是一次插入，并且start和end在同一行，并且行的末尾并没有超过右边界，那么我们没有必要调用fill-region。<br />
</p>

<p>
这意味着我们需要把fill-region的调用包裹在一个if里，如下所示：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span><span style="color: #F92672;">and</span> <span style="color: #A6E22E;">(</span>zerop len<span style="color: #A6E22E;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#22914;&#26524;&#26159;&#25554;&#20837;...</span>
         <span style="color: #A6E22E;">(</span>same-line-p start end<span style="color: #A6E22E;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">...&#24182;&#19988;&#27809;&#26377;&#36328;&#34892;</span>
         <span style="color: #A6E22E;">(</span>short-line-p end<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">...&#24182;&#19988;&#34892;&#20173;&#28982;&#22815;&#30701;</span>
    nil <span style="color: #75715E;">; </span><span style="color: #75715E;">&#37027;&#20040;&#20160;&#20040;&#37117;&#19981;&#20570;</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">save-excursion</span>
    <span style="color: #A6E22E;">(</span>fill-region ...<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#21542;&#21017;&#65292;refill</span>
</pre>
</div>

<p>
我们现在必须定义same-line-p和short-line-p。<br />
</p>

<p>
现在看来编写same-line-p应该很简单。我们只需要简单的检测end是否在start和行尾之间就可以了。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">same-line-p</span> <span style="color: #66D9EF;">(</span>start end<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Are START and END on the same line?"</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">save-excursion</span>
    <span style="color: #A6E22E;">(</span>goto-char start<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>end-of-line<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>&lt;= end <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
编写short-line-p也差不多同样明了。用于控制右边界的变量称为fill-column，而current-column返回一个点的横座标。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">short-line-p</span> <span style="color: #66D9EF;">(</span>pos<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Does line containing POS stay within 'fill-column'?"</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">save-excursion</span>
    <span style="color: #A6E22E;">(</span>goto-char pos<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>end-of-line<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>&lt;= <span style="color: #E6DB74;">(</span>current-column<span style="color: #E6DB74;">)</span> fill-column<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
下面是refill的新的定义：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">refill</span> <span style="color: #66D9EF;">(</span>start end len<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"After a text change, refill the current paragraph."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>left <span style="color: #FD971F;">(</span><span style="color: #F92672;">if</span> <span style="color: #F92672;">(</span><span style="color: #F92672;">or</span> <span style="color: #AE81FF;">(</span>zerop len<span style="color: #AE81FF;">)</span>
                      <span style="color: #AE81FF;">(</span>not <span style="color: #66D9EF;">(</span>before-2nd-word-p start<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">)</span>
                  start
                <span style="color: #F92672;">(</span><span style="color: #F92672;">save-excursion</span>
                  <span style="color: #AE81FF;">(</span>max <span style="color: #66D9EF;">(</span><span style="color: #F92672;">progn</span>
                         <span style="color: #A6E22E;">(</span>goto-char start<span style="color: #A6E22E;">)</span>
                         <span style="color: #A6E22E;">(</span>beginning-of-line 0<span style="color: #A6E22E;">)</span>
                         <span style="color: #A6E22E;">(</span>point<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
                       <span style="color: #66D9EF;">(</span><span style="color: #F92672;">progn</span>
                         <span style="color: #A6E22E;">(</span>goto-char start<span style="color: #A6E22E;">)</span>
                         <span style="color: #A6E22E;">(</span>backward-paragraph 1<span style="color: #A6E22E;">)</span>
                         <span style="color: #A6E22E;">(</span>point<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span><span style="color: #F92672;">if</span> <span style="color: #E6DB74;">(</span><span style="color: #F92672;">and</span> <span style="color: #FD971F;">(</span>zerop len<span style="color: #FD971F;">)</span>
             <span style="color: #FD971F;">(</span>same-line-p start end<span style="color: #FD971F;">)</span>
             <span style="color: #FD971F;">(</span>short-line-p end<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
        nil
      <span style="color: #E6DB74;">(</span><span style="color: #F92672;">save-excursion</span>
        <span style="color: #FD971F;">(</span>fill-region left end nil nil t<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
