7.org
** 尾空格
我们还是没有解决fill-region会删除每行最后尾部空格的问题，也就是当你进行编辑的时候，你需要输入likethis，然后将光标移动到中间再插入一个空格！

我们的策略是当光标在行末空格的后面，或者光标在行末空格之间的时候不进行refill。这个条件可以被实现为
#+BEGIN_SRC emacs-lisp
  (and (eq (char-syntax (preceding-char))
           ?\ )
       (looking-at "\\s *$"))
#+END_SRC

当光标前的字符为空格而光标后面只有空格的时候为真。让我们仔细看一下它。

首先我们计算(char-syntax (preceding-char))，这将会得到光标前面的字符的语法类别，然后跟'?\'进行比较。这个奇怪的结构--问号，斜杠，空格--是Emacs Lisp中书写空格字符的方式。回想空格字符是"whitespace"语法类别的code letter，所以这个是用来检测前面的字符是否为空格的。

下一步我们调用looking-at，一个用来检测光标后的文本是否符合一个给定的正则表达式的函数。这个例子里的正则表达式是\s *$(之前说过，在Lisp字符串里斜杠需要加倍)。在Emacs Lisp正则表达式里，\s表示引入基于当前buffer语法表的一个语法类别。\s之后的字符表示使用哪个语法类别。在这个例子里，也就是空格，表示"whitespace"。所以'\s '表示"匹配一个whitespace字符"，而\s *$表示"匹配0个或多个whitespace字符，直到行末尾"。

我们为refill的最后版本添加上这个检测。
#+BEGIN_SRC emacs-lisp
  (defun refill (start end len)
    "After a text change, refill the current paragraph."
    (let ((left (if (or (zerop len)
                        (not (before-2nd-word-p start)))
                    start
                  (save-excursion
                    (max (progn
                           (goto-char start)
                           (beginning-of-line 0)
                           (point))
                         (progn
                           (goto-char start)
                           (backward-paragraph 1)
                           (point)))))))
      (if (or (and (zerop len)
                   (same-line-p start end)
                   (short-line-p end))
              (and (eq (char-syntax (preceding-char))
                       ?\ )
                   (looking-at "\\s *$")))
          nil
        (save-excursion
          (fill-region left end nil nil t)))))
#+END_SRC

考虑到效率因素，通常应该避免将函数放到after-change-hooks里，特别是像refill这种复杂的函数。如果你的电脑够快，你可能注意不到每次按键执行这个函数的时间消耗；否则，你可能会发现你的Emacs变得反应缓慢。在下一章，我们将会找到一种方式来加速它。

<<7-27>>[27]. 除了我列出的这几个外还有很多其他的主模式。他们能用来编辑HTML文件、LATEX文件、ASCII文件、troff文件、二进制文件、目录等等等等。而且，主模式也用来实现许多例如新闻阅读或者网页浏览这种非编辑特性。试着输入M-x finder-by-keyword RET来浏览Emacs具有的模式和其他插件。

<<7-28>>[28]. 函数和变量的名称可以相同；它们不会冲突。

<<7-29>>[29]. 有的读者可能已经会指出当调用fill-paragraph的时候会改变buffer，而这会导致after-change-functions再次执行，再次递归的触发refill并且可能会导致无限循环，或者说是无限递归。说的不错，但是Emacs会在after-change-functions中的函数执行时重置它来避免这个问题。

<<7-30>>[30]. 要了解更多关于语法表的细节，执行describe-functions查看modify-syntax-entry。
