html/7.html

<div id="outline-container-org2994f9e" class="outline-3">
<h3 id="org2994f9e"><span class="section-number-3">5.5</span> 尾空格</h3>
<div class="outline-text-3" id="text-5-5">
<p>
我们还是没有解决fill-region会删除每行最后尾部空格的问题，也就是当你进行编辑的时候，你需要输入likethis，然后将光标移动到中间再插入一个空格！<br />
</p>

<p>
我们的策略是当光标在行末空格的后面，或者光标在行末空格之间的时候不进行refill。这个条件可以被实现为<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">and</span> <span style="color: #66D9EF;">(</span>eq <span style="color: #A6E22E;">(</span>char-syntax <span style="color: #E6DB74;">(</span>preceding-char<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
         ?\ <span style="color: #66D9EF;">)</span>
     <span style="color: #66D9EF;">(</span>looking-at <span style="color: #E6DB74;">"\\s *$"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
当光标前的字符为空格而光标后面只有空格的时候为真。让我们仔细看一下它。<br />
</p>

<p>
首先我们计算(char-syntax (preceding-char))，这将会得到光标前面的字符的语法类别，然后跟'?\'进行比较。这个奇怪的结构&#x2013;问号，斜杠，空格&#x2013;是Emacs Lisp中书写空格字符的方式。回想空格字符是"whitespace"语法类别的code letter，所以这个是用来检测前面的字符是否为空格的。<br />
</p>

<p>
下一步我们调用looking-at，一个用来检测光标后的文本是否符合一个给定的正则表达式的函数。这个例子里的正则表达式是\s *$(之前说过，在Lisp字符串里斜杠需要加倍)。在Emacs Lisp正则表达式里，\s表示引入基于当前buffer语法表的一个语法类别。\s之后的字符表示使用哪个语法类别。在这个例子里，也就是空格，表示"whitespace"。所以'\s '表示"匹配一个whitespace字符"，而\s *$表示"匹配0个或多个whitespace字符，直到行末尾"。<br />
</p>

<p>
我们为refill的最后版本添加上这个检测。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">refill</span> <span style="color: #66D9EF;">(</span>start end len<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"After a text change, refill the current paragraph."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>left <span style="color: #FD971F;">(</span><span style="color: #F92672;">if</span> <span style="color: #F92672;">(</span><span style="color: #F92672;">or</span> <span style="color: #AE81FF;">(</span>zerop len<span style="color: #AE81FF;">)</span>
                      <span style="color: #AE81FF;">(</span>not <span style="color: #66D9EF;">(</span>before-2nd-word-p start<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">)</span>
                  start
                <span style="color: #F92672;">(</span><span style="color: #F92672;">save-excursion</span>
                  <span style="color: #AE81FF;">(</span>max <span style="color: #66D9EF;">(</span><span style="color: #F92672;">progn</span>
                         <span style="color: #A6E22E;">(</span>goto-char start<span style="color: #A6E22E;">)</span>
                         <span style="color: #A6E22E;">(</span>beginning-of-line 0<span style="color: #A6E22E;">)</span>
                         <span style="color: #A6E22E;">(</span>point<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
                       <span style="color: #66D9EF;">(</span><span style="color: #F92672;">progn</span>
                         <span style="color: #A6E22E;">(</span>goto-char start<span style="color: #A6E22E;">)</span>
                         <span style="color: #A6E22E;">(</span>backward-paragraph 1<span style="color: #A6E22E;">)</span>
                         <span style="color: #A6E22E;">(</span>point<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span><span style="color: #F92672;">if</span> <span style="color: #E6DB74;">(</span><span style="color: #F92672;">or</span> <span style="color: #FD971F;">(</span><span style="color: #F92672;">and</span> <span style="color: #F92672;">(</span>zerop len<span style="color: #F92672;">)</span>
                 <span style="color: #F92672;">(</span>same-line-p start end<span style="color: #F92672;">)</span>
                 <span style="color: #F92672;">(</span>short-line-p end<span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span>
            <span style="color: #FD971F;">(</span><span style="color: #F92672;">and</span> <span style="color: #F92672;">(</span>eq <span style="color: #AE81FF;">(</span>char-syntax <span style="color: #66D9EF;">(</span>preceding-char<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
                     ?\ <span style="color: #F92672;">)</span>
                 <span style="color: #F92672;">(</span>looking-at <span style="color: #E6DB74;">"\\s *$"</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
        nil
      <span style="color: #E6DB74;">(</span><span style="color: #F92672;">save-excursion</span>
        <span style="color: #FD971F;">(</span>fill-region left end nil nil t<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
考虑到效率因素，通常应该避免将函数放到after-change-hooks里，特别是像refill这种复杂的函数。如果你的电脑够快，你可能注意不到每次按键执行这个函数的时间消耗；否则，你可能会发现你的Emacs变得反应缓慢。在下一章，我们将会找到一种方式来加速它。<br />
</p>

<p>
<a id="orga1a0468"></a>[27]. 除了我列出的这几个外还有很多其他的主模式。他们能用来编辑HTML文件、LATEX文件、ASCII文件、troff文件、二进制文件、目录等等等等。而且，主模式也用来实现许多例如新闻阅读或者网页浏览这种非编辑特性。试着输入M-x finder-by-keyword RET来浏览Emacs具有的模式和其他插件。<br />
</p>

<p>
<a id="orgfa68a53"></a>[28]. 函数和变量的名称可以相同；它们不会冲突。<br />
</p>

<p>
<a id="org54cbaa4"></a>[29]. 有的读者可能已经会指出当调用fill-paragraph的时候会改变buffer，而这会导致after-change-functions再次执行，再次递归的触发refill并且可能会导致无限循环，或者说是无限递归。说的不错，但是Emacs会在after-change-functions中的函数执行时重置它来避免这个问题。<br />
</p>

<p>
<a id="orge2e6a66"></a>[30]. 要了解更多关于语法表的细节，执行describe-functions查看modify-syntax-entry。<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
